Data Manipulation and analysis with pandas

Data manipulation and analysis are key tasks in any data science or data analysis project. pandas provides a wide range of functions for data manipulation and analysis, making it easier to clean,transform, and extract insights from data. In this lesson, we will cover various data manipulation ad analysis techniques using pandas.

In [49]:
import pandas as pd

In [50]:
df=pd.read_csv("homelessness.csv")

In [80]:
df.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop,Fill_NA_State_pop,individuals_new
0,0,East South Central,Alabama,2570.0,864.0,4887681.0,4.887681e+06,5140
1,1,Pacific,Alaska,582.0,735139.0,NaN,6.453124e+06,1164
2,2,Mountain,Arizona,7259.0,2606.0,7158024.0,7.158024e+06,14518
3,3,West South Central,Arkansas,2280.0,432.0,3009733.0,3.009733e+06,4560
4,4,Pacific,California,109008.0,20964.0,39461588.0,3.946159e+07,218016

Fetch the first 5 rows

In [52]:
df.head(5)

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681.0
1,1,Pacific,Alaska,582.0,735139.0,NaN
2,2,Mountain,Arizona,7259.0,2606.0,7158024.0
3,3,West South Central,Arkansas,2280.0,432.0,3009733.0
4,4,Pacific,California,109008.0,20964.0,39461588.0

Fetching the last five rows

In [53]:
df.tail(5)

,Unnamed: 0,region,state,individuals,family_members,state_pop
46,46,South Atlantic,Virginia,3928.0,2047.0,8501286.0
47,47,Pacific,Washington,16424.0,5880.0,7523869.0
48,48,South Atlantic,West Virginia,1021.0,222.0,1804291.0
49,49,East North Central,Wisconsin,2740.0,2167.0,5807406.0
50,50,Mountain,Wyoming,434.0,205.0,577601.0

Statistical description

In [54]:
df.describe()

       Unnamed: 0    individuals  family_members     state_pop
count   51.000000      51.000000    5.100000e+01  4.800000e+01
mean    25.000000    7037.627451    3.354886e+05  6.453124e+06
std     14.866069   16019.876508    1.659389e+06  7.487304e+06
min      0.000000     434.000000    7.500000e+01  5.776010e+05
25%     12.500000    1446.500000    6.085000e+02  1.790852e+06
50%     25.000000    2823.000000    1.696000e+03  4.321520e+06
75%     37.500000    6295.000000    3.328500e+03  7.249485e+06
max     50.000000  109008.000000    1.051113e+07  3.946159e+07

In [55]:
df.dtypes

Unnamed: 0          int64
region             object
state              object
individuals       float64
family_members    float64
state_pop         float64
dtype: object

Handling missing values

If true then missing values ow not missing values

In [81]:
df.isnull().head()

,Unnamed: 0,region,state,individuals,family_members,state_pop,Fill_NA_State_pop,individuals_new
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,True,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False

In [82]:
df[df.isnull()].head()

,Unnamed: 0,region,state,individuals,family_members,state_pop,Fill_NA_State_pop,individuals_new
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [83]:
df.isnull().any(axis=1).head()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [59]:
df.isnull().any()

Unnamed: 0        False
region            False
state             False
individuals       False
family_members    False
state_pop          True
dtype: bool

In [60]:
df.isnull().sum()

Unnamed: 0        0
region            0
state             0
individuals       0
family_members    0
state_pop         3
dtype: int64

whree there willl be the missing value it will be replace by the 0

In [86]:
df_filled=df.fillna(0)
df_filled.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop,Fill_NA_State_pop,individuals_new
0,0,East South Central,Alabama,2570.0,864.0,4887681.0,4.887681e+06,5140
1,1,Pacific,Alaska,582.0,735139.0,0.0,6.453124e+06,1164
2,2,Mountain,Arizona,7259.0,2606.0,7158024.0,7.158024e+06,14518
3,3,West South Central,Arkansas,2280.0,432.0,3009733.0,3.009733e+06,4560
4,4,Pacific,California,109008.0,20964.0,39461588.0,3.946159e+07,218016

Filling missing values with the mean of the column

In [63]:
df['state_pop_fill_NA']=df['state_pop'].fillna(df['state_pop'].mean())

In [85]:
df.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop,Fill_NA_State_pop,individuals_new
0,0,East South Central,Alabama,2570.0,864.0,4887681.0,4.887681e+06,5140
1,1,Pacific,Alaska,582.0,735139.0,NaN,6.453124e+06,1164
2,2,Mountain,Arizona,7259.0,2606.0,7158024.0,7.158024e+06,14518
3,3,West South Central,Arkansas,2280.0,432.0,3009733.0,3.009733e+06,4560
4,4,Pacific,California,109008.0,20964.0,39461588.0,3.946159e+07,218016

In [68]:
df.dtypes

Unnamed: 0             int64
region                object
state                 object
individuals          float64
family_members       float64
state_pop            float64
state_pop_fill_NA    float64
dtype: object

Renaming the columns

In [70]:
df=df.rename(columns={'state_pop_fill_NA':'Fill_NA_State_pop'})

In [71]:
df.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop,Fill_NA_State_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681.0,4.887681e+06
1,1,Pacific,Alaska,582.0,735139.0,NaN,6.453124e+06
2,2,Mountain,Arizona,7259.0,2606.0,7158024.0,7.158024e+06
3,3,West South Central,Arkansas,2280.0,432.0,3009733.0,3.009733e+06
4,4,Pacific,California,109008.0,20964.0,39461588.0,3.946159e+07

Change Datatypes

In [74]:
df['individuals_new']=df['individuals'].astype(int)
df.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop,Fill_NA_State_pop,individuals_new
0,0,East South Central,Alabama,2570.0,864.0,4887681.0,4.887681e+06,2570
1,1,Pacific,Alaska,582.0,735139.0,NaN,6.453124e+06,582
2,2,Mountain,Arizona,7259.0,2606.0,7158024.0,7.158024e+06,7259
3,3,West South Central,Arkansas,2280.0,432.0,3009733.0,3.009733e+06,2280
4,4,Pacific,California,109008.0,20964.0,39461588.0,3.946159e+07,109008

In [76]:
df.dtypes

Unnamed: 0             int64
region                object
state                 object
individuals          float64
family_members       float64
state_pop            float64
Fill_NA_State_pop    float64
individuals_new        int32
dtype: object

In [77]:
df['individuals_new']=df['individuals_new'].apply(lambda x:x*2)

In [79]:
df.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop,Fill_NA_State_pop,individuals_new
0,0,East South Central,Alabama,2570.0,864.0,4887681.0,4.887681e+06,5140
1,1,Pacific,Alaska,582.0,735139.0,NaN,6.453124e+06,1164
2,2,Mountain,Arizona,7259.0,2606.0,7158024.0,7.158024e+06,14518
3,3,West South Central,Arkansas,2280.0,432.0,3009733.0,3.009733e+06,4560
4,4,Pacific,California,109008.0,20964.0,39461588.0,3.946159e+07,218016

## Data Aggregating ad Grouping

In [ ]:
grouped_mean=df.groupby('state')['individuals_new'].mean()

In [91]:
grouped_mean.head()

state
Alabama         5140.0
Alaska          1164.0
Arizona        14518.0
Arkansas        4560.0
California    218016.0
Name: individuals_new, dtype: float64

In [96]:
grouped_categorical=df.groupby(['region','state'])['individuals_new'].sum()
grouped_categorical.head()

region              state
East North Central  Illinois     13504
                    Indiana       7552
                    Michigan     10418
                    Ohio         13858
                    Wisconsin     5480
Name: individuals_new, dtype: int64

In [98]:
df.groupby(['region','state'])['individuals_new'].mean().head()

region              state
East North Central  Illinois     13504.0
                    Indiana       7552.0
                    Michigan     10418.0
                    Ohio         13858.0
                    Wisconsin     5480.0
Name: individuals_new, dtype: float64

Aggregate Multiple Functions

In [99]:
grouped_agg=df.groupby('region')['individuals_new'].agg(['mean','sum','count'])
grouped_agg

                            mean     sum  count
region
East North Central  10162.400000   50812      5
East South Central   6234.000000   24936      4
Mid-Atlantic        36025.333333  108076      3
Mountain             6033.500000   48268      8
New England          4301.000000   25806      6
Pacific             56513.600000  282568      5
South Atlantic      10638.444444   95746      9
West North Central   3991.714286   27942      7
West South Central  13421.000000   53684      4

Merging and Joining DataFrames

In [107]:
#Create sample DataFrames

df1=pd.DataFrame({'Key':['A','B','C'], 'Value1': [1,2,3]})
df2=pd.DataFrame({'Key':['A','B','D'], 'Value2':[4,5,6]})

In [108]:
df1

  Key  Value1
0   A       1
1   B       2
2   C       3

In [109]:
df2

  Key  Value2
0   A       4
1   B       5
2   D       6

In [110]:
##Merge DataFrame on the 'key column'

pd.merge(df1,df2,on='Key',how="inner")

  Key  Value1  Value2
0   A       1       4
1   B       2       5

In [111]:
pd.merge(df1,df2,on='Key',how="outer")

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [113]:
pd.merge(df1,df2,on='Key',how="left")

  Key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [114]:
pd.merge(df1,df2,on='Key',how="right")

  Key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6